# NumDashStyles

## Description
Function NumDashStyles returns the number of available line dash patterns.

```pascal
FUNCTION NumDashStyles : INTEGER;
```

```python

def vs.NumDashStyles():
    return INTEGER
```

## Remarks
Returns the number of available line dash patterns.<BR>
<BR>
[sd 8/18/98]

## Examples
```pascal
numLS:=NumDashStyles;
```

## Version
```diff
- NumDashStyles is obsolete as of Vectorworks 2019
```

Availability: from MiniCAD4.0
## Category
* Document Attributes